use CourtGms;
-- ----------------------------
--  清空 `gms_action_log`
-- ----------------------------

truncate table gms_action_log;

-- ----------------------------
--  清空 `gms_addons`
-- ----------------------------
truncate table gms_addons;
BEGIN;
INSERT INTO `gms_addons` VALUES ('12', 'SiteStat', '站点统计信息', '统计站点的基础信息', '1', '1', '0', '\"\"', '0', '0', '', '0.1');
COMMIT;
-- ----------------------------
--  清空 `gms_auth_group`
-- ----------------------------
truncate table gms_auth_group;

BEGIN;
INSERT INTO `gms_auth_group` VALUES ('1', '超级管理员', '1', '299,301,302,305,300,298,6,209,242,243,244,57,218,219,295,272,58,59,60,25,28,26,27,17,20,84,13,14,15,16,4,296,297,61,45,46,47,48,49,52,51,50,29,32,31,30,33,34,35,36,80,81,82,83,5,37,39,40,62,38,217,259,257,260,264,266,268,285,1,208,210,245,246,247,248,275,276,277,278,273,281,280,279,287,290,289,288,274,284,283,282,291,292,293,294', '1', '1', '0', '拥有全部权限'), ('3', '观察者', '1', '299,301,305,300,209,242,243,244,218,219,217,259,257,260,264,266,268,1,208,210,245,246,247,248,275,277,278,276,273,279,280,281,274,284,283,282', '4', '1', '1', '只有查看权限'), ('8', '系统管理员', '1', '217,266,268,259,257,260,264,285,1,208,210,247,248,246,245,275,278,277,276,273,281,280,279,287,290,289,288,274,284,283,282,291,294,293,292,299,301,300,302,305,298,6,209,243,242,244,57,272,219,295,218,59,60,58,17,20,84,25,27,28,26,297', '3', '1', '1', '拥有部分权限、不包括核心权限'), ('22', '操作员', '1', '259,260,257,264,266,268,285,1,6,209', '0', '1', '1', '自动添加字段测试');
COMMIT;

-- ----------------------------
--  清空并插入初始信息 `gms_auth_rule`
-- ----------------------------
truncate table gms_auth_rule;

BEGIN;
INSERT INTO `gms_auth_rule` VALUES ('1', '0', '', '车辆管理', '', '2', '0', '1', '4', '', '0', '1'), ('217', '0', 'Manager/Index/index', '定位监控', 'iconfont icon-ioslocationoutline', '1', '0', '1', '0', '', '1', '1'), ('4', '298', '', '系统设置', 'iconfont icon-guanli', '2', '0', '1', '3', '', '0', '0'), ('5', '298', '', '数据库管理', 'iconfont icon-shujuku1', '2', '0', '1', '4', '', '0', '0'), ('6', '298', 'Admin/User/index', '用户管理', 'iconfont icon-user', '2', '0', '1', '1', '', '0', '1'), ('8', '3', '', '在线平台', '', '2', '1', '0', '1', '', '0', '1'), ('9', '3', '', '模块管理', '', '2', '0', '1', '2', '', '0', '0'), ('10', '3', '', '插件管理', '', '2', '0', '1', '3', '', '0', '0'), ('11', '8', 'Admin/Cloud/index?type=1', '模块商店', '', '2', '0', '1', '1', '', '0', '0'), ('12', '8', 'Admin/Cloud/index?type=2', '插件商店', '', '2', '0', '1', '2', '', '0', '0'), ('13', '6', 'Admin/Action/index', '日志配置', 'iconfont icon-jishurizhishezhi20', '1', '0', '1', '5', '', '0', '0'), ('14', '13', 'Admin/Action/add', '新增', '', '1', '0', '1', '1', '', '0', '1'), ('15', '13', 'Admin/Action/edit', '编辑', '', '1', '0', '1', '1', '', '0', '1'), ('16', '13', 'Admin/Action/del', '删除', '', '1', '0', '1', '1', '', '0', '1'), ('17', '6', 'Admin/ActionLog/index', '用户日志', 'iconfont icon-rizhi', '1', '0', '1', '4', '', '0', '1'), ('20', '17', 'Admin/ActionLog/del', '删除', '', '1', '0', '1', '1', '', '0', '1'), ('25', '6', 'Admin/AuthGroup/index', '角色权限', 'iconfont icon-guanli5', '1', '0', '1', '4', '', '0', '1'), ('26', '25', 'Admin/AuthGroup/add', '新增', '', '1', '0', '1', '1', '', '0', '1'), ('27', '25', 'Admin/AuthGroup/edit', '编辑', '', '1', '0', '1', '1', '', '0', '1'), ('28', '25', 'Admin/AuthGroup/del', '删除', '', '1', '0', '1', '1', '', '0', '1'), ('29', '4', 'Admin/AuthRule/index', '菜单管理', 'iconfont icon-shu', '1', '0', '1', '5', '', '0', '0'), ('30', '29', 'Admin/AuthRule/add', '新增', '', '1', '0', '1', '1', '', '0', '0'), ('31', '29', 'Admin/AuthRule/edit', '编辑', '', '1', '0', '1', '1', '', '0', '0'), ('32', '29', 'Admin/AuthRule/del', '删除', '', '1', '0', '1', '1', '', '0', '0'), ('33', '4', 'Admin/Config/index', '配置管理', 'iconfont icon-hammer', '1', '0', '1', '9', '', '0', '0'), ('34', '33', 'Admin/Config/add', '新增', '', '1', '0', '1', '1', '', '0', '0'), ('35', '33', 'Admin/Config/edit', '编辑', '', '1', '0', '1', '1', '', '0', '0'), ('36', '33', 'Admin/Config/del', '删除', '', '1', '0', '1', '1', '', '0', '0'), ('37', '5', 'Admin/Database/index?type=export', '备份数据库', 'iconfont icon-tongbushujukumoxing', '1', '0', '1', '1', '', '0', '0'), ('38', '62', 'Admin/Database/del', '删除', '', '1', '0', '1', '1', '', '0', '0'), ('39', '37', 'Admin/Database/repair', '修复表', '', '1', '0', '1', '1', '', '0', '0'), ('40', '37', 'Admin/Database/optimize', '优化表', '', '1', '0', '1', '1', '', '0', '0'), ('300', '301', 'Service/VehicleViolationReport/index', '规费统计报表', 'iconfont icon-chelianggenzong', '1', '0', '1', '1', '', '0', '1'), ('45', '4', 'Admin/Model/index', '模型管理', 'iconfont icon-ioskeypadoutline', '1', '0', '1', '3', '', '0', '1'), ('46', '45', 'Admin/Model/add', '新增', '', '1', '0', '1', '1', '', '0', '0'), ('47', '45', 'Admin/Model/edit', '编辑', '', '1', '0', '1', '1', '', '0', '0'), ('48', '45', 'Admin/Model/del', '删除', '', '1', '0', '1', '1', '', '0', '0'), ('49', '4', 'Admin/ModelField/index', '字段管理', 'iconfont icon-guanli1', '1', '1', '1', '4', '', '0', '0'), ('50', '49', 'Admin/ModelField/add', '新增', '', '1', '0', '1', '1', '', '0', '0'), ('51', '49', 'Admin/ModelField/edit', '编辑', '', '1', '0', '1', '1', '', '0', '0'), ('52', '49', 'Admin/ModelField/del', '删除', '', '1', '0', '1', '1', '', '0', '0'), ('61', '4', 'Admin/Config/group', '系统设置', 'iconfont icon-iossettings', '1', '0', '1', '1', '', '0', '0'), ('57', '6', 'Admin/User/index', '用户管理', 'iconfont icon-jiaoseshezhi', '1', '0', '1', '3', '', '0', '1'), ('58', '57', 'Admin/User/add', '新增', '', '1', '0', '1', '1', '', '0', '1'), ('59', '57', 'Admin/User/edit', '编辑', '', '1', '0', '1', '1', '', '0', '1'), ('60', '57', 'Admin/User/del', '删除', '', '1', '0', '1', '1', '', '0', '1'), ('62', '5', 'Admin/Database/index?type=import', '还原数据库', 'iconfont icon-shujuku1', '1', '0', '1', '1', '', '0', '0'), ('79', '10', 'Admin/Addons/index', '插件管理', '', '1', '0', '1', '44', '', '0', '0'), ('80', '4', 'Admin/Hooks/index', '钩子管理', 'iconfont icon-jiaoyiguanli', '1', '0', '1', '20', '', '0', '0'), ('81', '80', 'Admin/Hooks/add', '新增', '', '1', '0', '1', '1', '', '0', '0'), ('82', '80', 'Admin/Hooks/edit', '编辑', '', '1', '0', '1', '2', '', '0', '0'), ('83', '80', 'Admin/Hooks/del', '删除', '', '1', '1', '1', '3', '', '0', '0'), ('84', '17', 'Admin/ActionLog/edit', '查看', '', '1', '0', '1', '1', '', '0', '1'), ('85', '8', 'Admin/Cloud/index?type=3', '开发者', '', '1', '0', '1', '3', '', '0', '0'), ('90', '9', 'Admin/Module/index', '模块管理', '', '1', '0', '1', '0', '', '0', '0'), ('91', '90', 'Admin/Module/add', '安装', '', '1', '0', '1', '1', '', '0', '1'), ('92', '90', 'Admin/Module/disabled', '启用', '', '1', '0', '1', '2', '', '0', '1'), ('93', '90', 'Admin/Module/del', '卸载', '', '1', '1', '1', '3', '', '0', '1'), ('208', '1', 'Service/GroupInfo/index', '车辆管理', 'iconfont icon-car1', '2', '0', '1', '2', '', '0', '1'), ('209', '6', 'Service/GroupInfo/index', '组织架构', 'iconfont icon-zuzhiguanli', '1', '0', '1', '1', '', '0', '1'), ('210', '208', 'Service/VehicleInfo/index', '车辆信息管理', 'iconfont icon-cheshangguanli', '1', '0', '1', '2', '', '0', '1'), ('276', '275', 'service/vehicleViolationInfo/Create', '添加', '', '1', '0', '1', '0', '', '0', '1'), ('277', '275', 'service/vehicleViolationInfo/Update', '修改', '', '1', '0', '1', '0', '', '0', '1'), ('218', '57', 'Admin/User/userinfo', '个人资料', '', '1', '1', '1', '0', '', '0', '1'), ('219', '57', 'Admin/User/updatepassword', '修改密码', '', '1', '1', '1', '0', '', '0', '1'), ('257', '259', 'Manager/Index/track', '跟踪', '', '1', '0', '1', '0', '', '0', '1'), ('299', '0', '', '查询统计', '', '1', '0', '1', '4', '', '0', '1'), ('298', '0', '', '系统管理', '', '1', '0', '1', '5', '', '0', '1'), ('242', '209', 'Service/GroupInfo/add', '添加', '', '1', '0', '1', '0', '', '0', '1'), ('243', '209', 'Service/GroupInfo/del', '删除', '', '1', '0', '1', '0', '', '0', '1'), ('244', '209', 'Service/GroupInfo/edit', '修改', '', '1', '0', '1', '0', '', '0', '1'), ('245', '210', 'Service/VehicleInfo/Create', '添加', '', '1', '0', '1', '0', '', '0', '1'), ('246', '210', 'Service/VehicleInfo/Delete', '删除', '', '1', '0', '1', '0', '', '0', '1'), ('247', '210', 'Service/VehicleInfo/Update', '修改', '', '1', '0', '1', '0', '', '0', '1'), ('248', '210', 'Service/VehicleInfo/UpdateGroupId', '修改-转组', '', '1', '0', '1', '0', '', '0', '1'), ('274', '208', 'service/VehicleInsuranceInfo/index', '车辆保险管理', 'iconfont icon-cheliangyujing-copy', '1', '0', '1', '6', '', '0', '1'), ('275', '208', 'service/vehicleViolationInfo/index', '车辆规费管理', 'iconfont icon-chelianggenzong', '1', '0', '1', '3', '', '0', '1'), ('259', '217', '', '指令下发', '', '1', '0', '1', '0', '', '0', '1'), ('260', '259', 'Manager/Track/history', '历史查询', 'iconfont icon-paperairplane', '1', '0', '1', '0', '', '0', '1'), ('287', '208', 'service/VehicleMaintenanceInfo/index', '车辆保养管理', 'iconfont icon-cheliangbaoyang', '1', '0', '1', '5', '', '0', '1'), ('262', '261', 'Manager/RealVideo/index', '实时视频', '', '1', '0', '1', '0', '', '0', '1'), ('264', '259', 'Manager/Track/index', '路径回放', '', '1', '1', '1', '6', '', '1', '1'), ('266', '217', '', '其他', '', '1', '0', '1', '0', '', '0', '1'), ('273', '208', 'service/VehicleRepairInfo/index', '车辆维修管理', 'iconfont icon-cheliangweixiujiancezhan', '1', '0', '1', '4', '', '0', '1'), ('268', '266', 'Manager/Index/showCarInfosDetail', '查看车辆详情', '', '1', '0', '1', '0', '', '0', '1'), ('272', '57', 'Admin/User/group', '角色修改', '', '1', '1', '1', '0', '', '0', '1'), ('278', '275', 'service/vehicleViolationInfo/Delete', '删除', '', '1', '0', '1', '0', '', '0', '1'), ('279', '273', 'service/VehicleRepairInfo/Create', '添加', '', '1', '0', '1', '0', '', '0', '1'), ('280', '273', 'service/VehicleRepairInfo/Update', '修改', '', '1', '0', '1', '0', '', '0', '1'), ('281', '273', 'service/VehicleRepairInfo/Delete', '删除', '', '1', '0', '1', '0', '', '0', '1'), ('282', '274', 'service/VehicleInsuranceInfo/Create', '添加', '', '1', '0', '1', '0', '', '0', '1'), ('283', '274', 'service/VehicleInsuranceInfo/Update', '修改', '', '1', '0', '1', '0', '', '0', '1'), ('284', '274', 'service/VehicleInsuranceInfo/Delete', '删除', '', '1', '0', '1', '0', '', '0', '1'), ('285', '0', 'Manager/RealVideo/index', '视频监控', 'iconfont icon-cheliangjiankong', '1', '0', '1', '1', '', '1', '1'), ('290', '287', 'service/VehicleMaintenanceInfo/Delete', '删除', '', '1', '0', '1', '0', '', '0', '1'), ('289', '287', 'service/VehicleMaintenanceInfo/Update', '修改', '', '1', '0', '1', '0', '', '0', '1'), ('288', '287', 'service/VehicleMaintenanceInfo/Create', '添加', '', '1', '0', '1', '0', '', '0', '1'), ('291', '208', 'Service/VehicleRecordInfo/index', '出车记录管理', 'iconfont icon-zonghecheliangxinxiguanli', '1', '0', '1', '7', '', '0', '1'), ('292', '291', 'Service/VehicleRecordInfo/Create', '添加', '', '1', '0', '1', '0', '', '0', '1'), ('293', '291', 'Service/VehicleRecordInfo/Update', '编辑', '', '1', '0', '1', '0', '', '0', '1'), ('294', '291', 'Service/VehicleRecordInfo/Delete', '删除', '', '1', '0', '1', '0', '', '0', '1'), ('295', '57', 'Admin/User/updatepassword1', '忘记密码', '', '1', '0', '1', '0', '', '0', '1'), ('296', '4', 'Manager/Setting/generateLogs', '导出日志', 'iconfont icon-ioslistoutline', '1', '1', '1', '0', '', '0', '0'), ('297', '4', 'Manager/Setting/setting', '地图设置', '', '1', '1', '1', '0', '', '0', '1'), ('301', '299', '', '查询统计', 'iconfont icon-iossearch', '1', '0', '1', '0', '', '0', '1'), ('302', '301', 'Service/VehicleMaintenanceReport/index', '保养统计报表', 'iconfont icon-cheliangbaoyang', '1', '0', '1', '5', '', '0', '1'), ('311', '301', 'Service/VehicleMaintenanceReport/echartsIndex', '保养次数图表', 'iconfont icon-cheliangbaoyang', '1', '0', '1', '6', '', '0', '1'), ('312', '301', 'Service/VehicleRepairReport/echartsIndex', '维修次数图表', 'iconfont icon-cheliangweixiujiancezhan', '1', '0', '1', '4', '', '0', '1'), ('305', '301', 'Service/VehicleRepairReport/index', '维修统计报表', 'iconfont icon-cheliangweixiujiancezhan', '1', '0', '1', '3', '', '0', '1'), ('309', '301', 'Service/VehicleInsuranceReport/index', '保险统计报表', 'iconfont icon-cheliangyujing-copy', '1', '0', '1', '7', '', '0', '1'), ('310', '301', 'Service/VehicleReport/index', '费用统计报表', 'iconfont icon-shuju', '1', '0', '1', '8', '', '0', '1'), ('313', '301', 'Service/VehicleViolationReport/echartsIndex', '规费次数图表', 'iconfont icon-chelianggenzong', '1', '0', '1', '2', '', '0', '1'), ('314', '301', 'Service/VehicleReport/echartsIndex', '费用统计图表', 'iconfont icon-shuju', '1', '0', '1', '9', '', '0', '1');
COMMIT;

-- ----------------------------
--  清空 `gms_cache`
-- ----------------------------
truncate table gms_cache;

BEGIN;
INSERT INTO `gms_cache` VALUES ('1', 'Config', '网站配置', 'Admin', 'Config', 'cache', '', '1'), ('2', 'Action', '行为列表', 'Admin', 'Action', 'cache', '', '0'), ('3', 'ActionLog', '行为日志', 'Admin', 'ActionLog', 'cache', '', '0');
COMMIT;

-- ----------------------------
--  清空 `gms_province`
-- ----------------------------
SET FOREIGN_KEY_CHECKS=0;
truncate table gms_city;
truncate table gms_province;
SET FOREIGN_KEY_CHECKS=1;

BEGIN;
INSERT INTO `gms_province` VALUES ('1', '北京市'), ('2', '天津市'), ('3', '河北省'), ('4', '山西省'), ('5', '内蒙古自治区'), ('6', '辽宁省'), ('7', '吉林省'), ('8', '黑龙江省'), ('9', '上海市'), ('10', '江苏省'), ('11', '浙江省'), ('12', '安徽省'), ('13', '福建省'), ('14', '江西省'), ('15', '山东省'), ('16', '河南省'), ('17', '湖北省'), ('18', '湖南省'), ('19', '广东省'), ('20', '广西壮族自治区'), ('21', '海南省'), ('22', '重庆市'), ('23', '四川省'), ('24', '贵州省'), ('25', '云南省'), ('26', '西藏自治区'), ('27', '陕西省'), ('28', '甘肃省'), ('29', '青海省'), ('30', '宁夏回族自治区'), ('31', '新疆维吾尔自治区'), ('32', '台湾省'), ('33', '香港特别行政区'), ('34', '澳门特别行政区');
COMMIT;

BEGIN;
INSERT INTO `gms_city` VALUES ('1', '东城区', '1'), ('2', '西城区', '1'), ('3', '崇文区', '1'), ('4', '宣武区', '1'), ('5', '朝阳区', '1'), ('6', '丰台区', '1'), ('7', '石景山区', '1'), ('8', '海淀区', '1'), ('9', '门头沟区', '1'), ('10', '房山区', '1'), ('11', '通州区', '1'), ('12', '顺义区', '1'), ('13', '昌平区', '1'), ('14', '大兴区', '1'), ('15', '怀柔区', '1'), ('16', '平谷区', '1'), ('17', '密云县', '1'), ('18', '延庆县', '1'), ('19', '和平区', '2'), ('20', '河东区', '2'), ('21', '河西区', '2'), ('22', '南开区', '2'), ('23', '河北区', '2'), ('24', '红桥区', '2'), ('25', '塘沽区', '2'), ('26', '汉沽区', '2'), ('27', '大港区', '2'), ('28', '东丽区', '2'), ('29', '西青区', '2'), ('30', '津南区', '2'), ('31', '北辰区', '2'), ('32', '武清区', '2'), ('33', '宝坻区', '2'), ('34', '宁河县', '2'), ('35', '静海县', '2'), ('36', '蓟县', '2'), ('37', '石家庄市', '3'), ('38', '唐山市', '3'), ('39', '秦皇岛市', '3'), ('40', '邯郸市', '3'), ('41', '邢台市', '3'), ('42', '保定市', '3'), ('43', '张家口', '3'), ('44', '承德市', '3'), ('45', '沧州市', '3'), ('46', '廊坊市', '3'), ('47', '衡水市', '3'), ('48', '太原市', '4'), ('49', '大同市', '4'), ('50', '阳泉市', '4'), ('51', '长治市', '4'), ('52', '晋城市', '4'), ('53', '朔州市', '4'), ('54', '晋中市', '4'), ('55', '运城市', '4'), ('56', '忻州市', '4'), ('57', '临汾市', '4'), ('58', '吕梁市', '4'), ('59', '呼和浩特市', '5'), ('60', '包头市', '5'), ('61', '乌海市', '5'), ('62', '赤峰市', '5'), ('63', '通辽市', '5'), ('64', '鄂尔多斯市', '5'), ('65', '呼伦贝尔市', '5'), ('66', '巴彦市', '5'), ('67', '乌兰察布市', '5'), ('68', '兴安盟', '5'), ('69', '锡林郭勒盟', '5'), ('70', '阿拉善盟', '5'), ('71', '沈阳市', '6'), ('72', '大连市', '6'), ('73', '鞍山市', '6'), ('74', '抚顺市', '6'), ('75', '本溪市', '6'), ('76', '丹东市', '6'), ('77', '锦州市', '6'), ('78', '营口市', '6'), ('79', '阜新市', '6'), ('80', '辽阳市', '6'), ('81', '盘锦市', '6'), ('82', '铁岭市', '6'), ('83', '朝阳市', '6'), ('84', '葫芦岛市', '6'), ('85', '长春市', '7'), ('86', '吉林市', '7'), ('87', '四平市', '7'), ('88', '辽源市', '7'), ('89', '通化市', '7'), ('90', '白山市', '7'), ('91', '松原市', '7'), ('92', '白城市', '7'), ('93', '延边朝鲜族自治州', '7'), ('94', '哈尔滨市', '8'), ('95', '齐齐哈尔市', '8'), ('96', '鸡西市', '8'), ('97', '鹤岗市', '8'), ('98', '双鸭山市', '8'), ('99', '大庆市', '8'), ('100', '伊春市', '8'), ('101', '佳木斯市', '8'), ('102', '七台河市', '8'), ('103', '牡丹江市', '8'), ('104', '黑河市', '8'), ('105', '绥化市', '8'), ('106', '大兴安岭地区', '8'), ('107', '黄浦区', '9'), ('108', '卢湾区', '9'), ('109', '徐汇区', '9'), ('110', '长宁区', '9'), ('111', '静安区', '9'), ('112', '普陀区', '9'), ('113', '闸北区', '9'), ('114', '虹口区', '9'), ('115', '杨浦区', '9'), ('116', '闵行区', '9'), ('117', '宝山区', '9'), ('118', '嘉定区', '9'), ('119', '浦东新区', '9'), ('120', '金山区', '9'), ('121', '松江区', '9'), ('122', '青浦区', '9'), ('123', '南汇区', '9'), ('124', '奉贤区', '9'), ('125', '崇明县', '9'), ('126', '南京市', '10'), ('127', '无锡市', '10'), ('128', '徐州市', '10'), ('129', '常州市', '10'), ('130', '苏州市', '10'), ('131', '南通市', '10'), ('132', '连云港市', '10'), ('133', '淮安市', '10'), ('134', '盐城市', '10'), ('135', '扬州市', '10'), ('136', '镇江市', '10'), ('137', '泰州市', '10'), ('138', '宿迁市', '10'), ('139', '杭州市', '11'), ('140', '宁波市', '11'), ('141', '温州市', '11'), ('142', '嘉兴市', '11'), ('143', '湖州市', '11'), ('144', '绍兴市', '11'), ('145', '金华市', '11'), ('146', '衢州市', '11'), ('147', '舟山市', '11'), ('148', '台州市', '11'), ('149', '丽水市', '11'), ('150', '合肥市', '12'), ('151', '芜湖市', '12'), ('152', '蚌埠市', '12'), ('153', '淮南市', '12'), ('154', '马鞍山市', '12'), ('155', '淮北市', '12'), ('156', '铜陵市', '12'), ('157', '安庆市', '12'), ('158', '黄山市', '12'), ('159', '滁州市', '12'), ('160', '阜阳市', '12'), ('161', '宿州市', '12'), ('162', '巢湖市', '12'), ('163', '六安市', '12'), ('164', '毫州市', '12'), ('165', '池州市', '12'), ('166', '宣城市', '12'), ('167', '福州市', '13'), ('168', '厦门市', '13'), ('169', '莆田市', '13'), ('170', '三明市', '13'), ('171', '泉州市', '13'), ('172', '漳州市', '13'), ('173', '南平市', '13'), ('174', '龙岩市', '13'), ('175', '宁德市', '13'), ('176', '南昌市', '14'), ('177', '景德镇市', '14'), ('178', '萍乡市', '14'), ('179', '九江市', '14'), ('180', '新余市', '14'), ('181', '鹰潭市', '14'), ('182', '赣州市', '14'), ('183', '吉安市', '14'), ('184', '宜春市', '14'), ('185', '抚州市', '14'), ('186', '上饶市', '14'), ('187', '济南市', '15'), ('188', '青岛市', '15'), ('189', '淄博市', '15'), ('190', '枣庄市', '15'), ('191', '东营市', '15'), ('192', '烟台市', '15'), ('193', '潍坊市', '15'), ('194', '济宁市', '15'), ('195', '泰安市', '15'), ('196', '威海市', '15'), ('197', '日照市', '15'), ('198', '莱芜市', '15'), ('199', '临沂市', '15'), ('200', '德州市', '15'), ('201', '聊城市', '15'), ('202', '滨州市', '15'), ('203', '菏泽市', '15'), ('204', '郑州市', '16'), ('205', '开封市', '16'), ('206', '洛阳市', '16'), ('207', '平顶山市', '16'), ('208', '安阳市', '16'), ('209', '鹤壁市', '16'), ('210', '新乡市', '16'), ('211', '焦作市', '16'), ('212', '濮阳市', '16'), ('213', '许昌市', '16'), ('214', '漯河市', '16'), ('215', '三门峡市', '16'), ('216', '南阳市', '16'), ('217', '商丘市', '16'), ('218', '信阳市', '16'), ('219', '周口市', '16'), ('220', '驻马店市', '16'), ('221', '武汉市', '17'), ('222', '黄石市', '17'), ('223', '十堰市', '17'), ('224', '宜昌市', '17'), ('225', '襄樊市', '17'), ('226', '鄂州市', '17'), ('227', '荆门市', '17'), ('228', '孝感市', '17'), ('229', '荆州市', '17'), ('230', '黄冈市', '17'), ('231', '咸宁市', '17'), ('232', '随州市', '17'), ('233', '恩施土家族苗族自治州', '17'), ('234', '长沙市', '18'), ('235', '株洲市', '18'), ('236', '湘潭市', '18'), ('237', '衡阳市', '18'), ('238', '邵阳市', '18'), ('239', '岳阳市', '18'), ('240', '常德市', '18'), ('241', '张家界市', '18'), ('242', '益阳市', '18'), ('243', '郴州市', '18'), ('244', '永州市', '18'), ('245', '怀化市', '18'), ('246', '娄底市', '18'), ('247', '湘西土家苗族自治州', '18'), ('248', '广州市', '19'), ('249', '韶关市', '19'), ('250', '深圳市', '19'), ('251', '珠海市', '19'), ('252', '汕头市', '19'), ('253', '佛山市', '19'), ('254', '江门市', '19'), ('255', '湛江市', '19'), ('256', '茂名市', '19'), ('257', '肇庆市', '19'), ('258', '惠州市', '19'), ('259', '梅州市', '19'), ('260', '汕尾市', '19'), ('261', '河源市', '19'), ('262', '阳江市', '19'), ('263', '清远市', '19'), ('264', '东莞市', '19'), ('265', '中山市', '19'), ('266', '潮州市', '19'), ('267', '揭阳市', '19'), ('268', '云浮市', '19'), ('269', '南宁市', '20'), ('270', '柳州市', '20'), ('271', '桂林市', '20'), ('272', '梧州市', '20'), ('273', '北海市', '20'), ('274', '防城港市', '20'), ('275', '钦州市', '20'), ('276', '贵港市', '20'), ('277', '玉林市', '20'), ('278', '百色市', '20'), ('279', '贺州市', '20'), ('280', '河池市', '20'), ('281', '来宾市', '20'), ('282', '崇左市', '20'), ('283', '海口市', '21'), ('284', '三亚市', '21'), ('285', '三沙市', '21'), ('286', '三沙市', '21'), ('287', '万州区', '22'), ('288', '涪陵区', '22'), ('289', '渝中区', '22'), ('290', '大渡口区', '22'), ('291', '江北区', '22'), ('292', '沙坪坝区', '22'), ('293', '九龙坡区', '22'), ('294', '南岸区', '22'), ('295', '北碚区', '22'), ('296', '綦江区', '22'), ('297', '大足区', '22'), ('298', '渝北区', '22'), ('299', '巴南区', '22'), ('300', '黔江区', '22'), ('301', '长寿区', '22'), ('302', '江津区', '22'), ('303', '合川区', '22'), ('304', '永川区', '22'), ('305', '南川区', '22'), ('306', '成都市', '23'), ('307', '自贡市', '23'), ('308', '攀枝花市', '23'), ('309', '泸州市', '23'), ('310', '德阳市', '23'), ('311', '绵阳市', '23'), ('312', '广元市', '23'), ('313', '遂宁市', '23'), ('314', '内江市', '23'), ('315', '乐山市', '23'), ('316', '南充市', '23'), ('317', '眉山市', '23'), ('318', '宜宾市', '23'), ('319', '广安市', '23'), ('320', '达州市', '23'), ('321', '雅安市', '23'), ('322', '巴中市', '23'), ('323', '资阳市', '23'), ('324', '阿坝藏族羌族自治州', '23'), ('325', '甘孜藏族自治州', '23'), ('326', '凉山彝族自治州', '23'), ('327', '贵阳市', '24'), ('328', '六盘水市', '24'), ('329', '遵义市', '24'), ('330', '安顺市', '24'), ('331', '铜仁地区', '24'), ('332', '黔西南布依族苗族自治州', '24'), ('333', '毕节地区', '24'), ('334', '黔东南苗族侗族自治州', '24'), ('335', '黔南布依族苗族自治州', '24'), ('336', '昆明市', '25'), ('337', '曲靖市', '25'), ('338', '玉溪市', '25'), ('339', '保山市', '25'), ('340', '昭通市', '25'), ('341', '丽江市', '25'), ('342', '普洱市', '25'), ('343', '临沧市', '25'), ('344', '楚雄彝族自治州', '25'), ('345', '红河哈尼彝族自治州', '25'), ('346', '文山壮族苗族自治州', '25'), ('347', '西双版纳傣族自治州', '25'), ('348', '大理白族自治州', '25'), ('349', '德宏傣族景颇族自治州', '25'), ('350', '怒江傈僳族自治州', '25'), ('351', '迪庆藏族自治州', '25'), ('352', '拉萨市', '26'), ('353', '昌都地区', '26'), ('354', '山南地区', '26'), ('355', '日喀则地区', '26'), ('356', '那曲地区', '26'), ('357', '阿里地区', '26'), ('358', '林芝地区', '26'), ('359', '西安市', '27'), ('360', '铜川市', '27'), ('361', '宝鸡市', '27'), ('362', '咸阳市', '27'), ('363', '渭南市', '27'), ('364', '延安市', '27'), ('365', '汉中市', '27'), ('366', '榆林市', '27'), ('367', '安康市', '27'), ('368', '商洛市', '27'), ('369', '兰州市', '28'), ('370', '嘉峪关市', '28'), ('371', '金昌市', '28'), ('372', '白银市', '28'), ('373', '天水市', '28'), ('374', '武威市', '28'), ('375', '张掖市', '28'), ('376', '平凉市', '28'), ('377', '酒泉市', '28'), ('378', '庆阳市', '28'), ('379', '定西市', '28'), ('380', '陇南市', '28'), ('381', '临夏回族自治州', '28'), ('382', '甘南藏族自治州', '28'), ('383', '西宁市', '29'), ('384', '海东地区', '29'), ('385', '海北藏族自治州', '29'), ('386', '黄南藏族自治州', '29'), ('387', '海南藏族自治州', '29'), ('388', '果洛藏族自治州', '29'), ('389', '玉树藏族自治州', '29'), ('390', '海西蒙古族藏族自治州', '29'), ('391', '银川市', '30'), ('392', '石嘴山市', '30'), ('393', '吴忠市', '30'), ('394', '固原市', '30'), ('395', '中卫市', '30'), ('396', '乌鲁木齐市', '31'), ('397', '克拉玛依市', '31'), ('398', '吐鲁番地区', '31'), ('399', '哈密地区', '31'), ('400', '昌吉回族自治州', '31'), ('401', '博尔塔拉蒙古自治州', '31'), ('402', '巴音郭楞蒙古自治州', '31'), ('403', '阿克苏地区', '31'), ('404', '克孜勒苏柯尔克孜自治州', '31'), ('405', '喀什地区', '31'), ('406', '和田地区', '31'), ('407', '伊犁哈萨克自治州', '31'), ('408', '塔城地区', '31'), ('409', '阿勒泰地区', '31');
COMMIT;


-- ----------------------------
--  清空 `gms_config`
-- ----------------------------
truncate table gms_config;

BEGIN;
INSERT INTO `gms_config` VALUES ('1', 'WEB_SITE_TITLE', '1', '网站标题', '1', '', '网站标题前台显示标题', '1378898976', '1379235274', '1', '内蒙古高院', '0'), ('2', 'WEB_SITE_DESCRIPTION', '2', '网站描述', '1', '', '网站搜索引擎描述', '1378898976', '1379235841', '1', 'ThinkGms内置：thinkphp,EasyUI,AmazeUI,KE编辑器', '1'), ('3', 'WEB_SITE_KEYWORD', '2', '网站关键字', '1', '', '网站搜索引擎关键字', '1378898976', '1381390100', '1', '让你的开发更便捷！~', '8'), ('4', 'WEB_SITE_CLOSE', '4', '关闭站点', '1', '0:关闭|1:开启', '站点关闭后其他用户不能访问，管理员可以正常访问', '1378898976', '1379235296', '1', '1', '1'), ('9', 'CONFIG_TYPE_LIST', '3', '配置类型', '4', '', '主要用于数据解析和页面表单的生成', '1378898976', '1379235348', '1', '0:数字|1:字符|2:文本|3:数组|4:枚举|5:编辑器', '2'), ('10', 'WEB_SITE_ICP', '1', '网站备案号', '1', '', '设置在网站底部显示的备案号，如“沪ICP备12007941号-2', '1378900335', '1379235859', '1', '000-1', '9'), ('20', 'CONFIG_GROUP_LIST', '3', '配置分组', '4', '', '用于系统配置中批量更改的分组', '1379228036', '1384418383', '1', '1:基本|2:内容|3:用户|4:系统', '4'), ('28', 'DATA_BACKUP_PATH', '1', '数据库备份根路径', '4', '', '路径必须以 / 结尾', '1381482411', '1381482411', '1', './Data/', '5'), ('29', 'DATA_BACKUP_PART_SIZE', '0', '数据库备份卷大小', '4', '', '该值用于限制压缩后的分卷最大长度。单位：B；建议设置20M', '1381482488', '1381729564', '1', '20971520', '7'), ('30', 'DATA_BACKUP_COMPRESS', '4', '数据库备份文件是否启用压缩', '4', '0:不压缩|1:启用压缩', '压缩备份文件需要PHP环境支持gzopen,gzwrite函数', '1381713345', '1381729544', '1', '1', '9'), ('31', 'DATA_BACKUP_COMPRESS_LEVEL', '4', '数据库备份文件压缩级别', '4', '1:普通|4:一般|9:最高', '数据库备份文件的压缩级别，该配置在开启压缩时生效', '1381713408', '1381713408', '1', '1', '10'), ('37', 'SHOW_PAGE_TRACE', '4', '是否显示页面Trace信息', '4', '0:关闭|1:开启', '是否显示页面Trace信息', '1387165685', '1387165685', '1', '0', '1'), ('58', 'ACTION_TYPE', '3', '行为类型', '3', '', '行为的类型', '0', '0', '1', '1:系统|2:用户', '0'), ('59', 'USER_STATUS_TYPE', '3', '用户状态类型', '3', '', '用户状态类型', '0', '0', '1', '0:禁用|1:启用', '0'), ('60', 'USERGROUP_STATUS_TYPE', '3', '用户组状态', '3', '', '用户组状态', '0', '0', '1', '0:禁用|1:启用|2:暂停使用|3:废弃', '0'), ('61', 'ADMIN_QQ', '1', '管理员QQ', '4', '管理员的QQ号码', '', '0', '0', '1', '', '0'), ('62', 'LEFT_MENU_STYLE', '4', '左侧导航风格', '4', '1:Metro|2:列表', '', '0', '0', '1', '1', '0'), ('63', 'ADMIN_LOGIN_BG_TYPE', '4', '后台登录背景类型', '4', '0:纯色|1:根据值|2:随机（1-5）', '', '0', '0', '1', '2', '0'), ('64', 'ADMIN_LOGIN_BG_IMG', '2', '后台登录背景图片路径', '4', '', '', '0', '0', '1', './Public/Admin/images/Login/bg_1.jpg', '0'), ('65', 'ADMIN_REME', '0', '后台记住密码时间', '4', '', '', '0', '0', '1', '3600', '0');
COMMIT;

-- ----------------------------
--  清空 `gms_hooks`
-- ----------------------------
truncate table gms_hooks;

BEGIN;
INSERT INTO `gms_hooks` VALUES ('1', 'pageHeader', '页面header钩子，一般用于加载插件CSS文件和代码', '1', '0', '', '1'), ('2', 'pageFooter', '页面footer钩子，一般用于加载插件JS文件和JS代码', '1', '0', '', '1'), ('3', 'AdminIndex', '首页小格子个性化显示', '1', '1382596073', 'SiteStat', '1'), ('4', 'app_begin', '应用开始', '2', '1384481614', '', '1');
COMMIT;


-- ----------------------------
--  清空 `gms_user`
-- ----------------------------
truncate table gms_user;

BEGIN;
INSERT INTO `gms_user` VALUES ('1', 'root', '21232f297a57a5a743894a0e4a801fc3', '0', '', '', '', '1488f53ea3bbd42594aa47f01d35a3cd.png', '', '0', '1458034376', '1476752335', '1', '1', '1', '0'), ('28', 'admin', '21232f297a57a5a743894a0e4a801fc3', '0', null, '', '', '', '', '0', '1476756258', '1476756441', '1', '8', '1', '1');
COMMIT;

-- ----------------------------
--  清空 `manager_car_image_setting`
-- ----------------------------
truncate table manager_car_image_setting;

BEGIN;
INSERT INTO `manager_car_image_setting` VALUES ('0', '箭头-灰', '/CourtGms/Public/Manager/image/0/', '车状态', '.gif'), ('1', '箭头-绿', '/CourtGms/Public/Manager/image/1/', '车状态', '.gif'), ('2', '箭头-红', '/CourtGms/Public/Manager/image/2/', '车状态', '.gif'), ('3', '车-红', '/CourtGms/Public/Manager/image/car1/', '车状态', '.png'), ('4', '车-绿', '/CourtGms/Public/Manager/image/car0/', '车状态', '.png'), ('5', '车-灰', '/CourtGms/Public/Manager/image/car2/', '车状态', '.png'), ('7', '车-深绿', '/CourtGms/Public/Manager/image/car4/', '车状态', '.png'), ('8', '车-深灰', '/CourtGms/Public/Manager/image/car5/', '车状态', '.png'), ('9', '车-深红', '/CourtGms/Public/Manager/image/car6/', '车状态', '.png'),('6', '车-深蓝', '/CourtGms/Public/Manager/image/car3/', '车状态', '.png');
COMMIT;

-- ----------------------------
--  清空 `manager_setting`
-- ----------------------------
truncate table manager_setting;

BEGIN;
INSERT INTO `manager_setting` VALUES ('7', '8', '10', '0', '9');
COMMIT;

-- ----------------------------
--  清空 `service_group_info`
-- ----------------------------
truncate table service_group_info;

BEGIN;
INSERT INTO `service_group_info` VALUES ('1', null, null, '内蒙古高院', '/1/', '', '0', '');
COMMIT;

-- ----------------------------
--  清空 `service_keda_info`
-- ----------------------------
truncate table service_keda_info;

-- ----------------------------
--  清空 `service_vehicle_info`
-- ----------------------------
truncate table service_vehicle_info;

-- ----------------------------
--  清空 `service_vehicle_insurance_info`
-- ----------------------------
truncate table service_vehicle_insurance_info;

-- ----------------------------
--  清空 `service_vehicle_maintenance_info`
-- ----------------------------
truncate table service_vehicle_maintenance_info;

-- ----------------------------
--  清空 `service_vehicle_record`
-- ----------------------------
truncate table service_vehicle_record;

-- ----------------------------
--  清空 `service_vehicle_repair_info`
-- ----------------------------
truncate table service_vehicle_repair_info;

-- ----------------------------
--  清空 `service_vehicle_violation_info`
-- ----------------------------
truncate table service_vehicle_violation_info;

-- ----------------------------
--  清空 `service_word_book`
-- ----------------------------
truncate table service_word_book;

BEGIN;
INSERT INTO `service_word_book` VALUES ('1', '10', '客车', '1'), ('2', '11', '大型客车', '1'), ('3', '13', '小型客车', '1'), ('4', '14', '轿车', '1'), ('5', '15', '大型卧铺客车', '1'), ('6', '20', '普通货车', '1'), ('7', '21', '大型普通货车', '1'), ('8', '22', '中型普通货车', '1'), ('9', '23', '小型普通货车', '1'), ('10', '30', '专用运输车', '1'), ('11', '31', '集装箱车', '1'), ('12', '32', '大型运输车', '1'), ('13', '33', '保温冷藏车', '1'), ('14', '34', '商品车运输专用车辆', '1'), ('15', '35', '罐车', '1'), ('16', '36', '牵引车', '1'), ('17', '37', '挂车', '1'), ('18', '38', '平板车', '1'), ('19', '39', '其他专用车', '1'), ('20', '40', '危险品运输车', '1'), ('21', '50', '农用车', '1'), ('22', '90', '其他车辆', '1'), ('23', '1', '企业', '2'), ('24', '2', '车队', '2'), ('25', '0', '城市公共交通运输', '3'), ('26', '1', '公共电汽车客运', '3'), ('27', '2', '城市轨迹交通', '3'), ('28', '3', '出租车客运', '3'), ('29', '4', '其他城市公共交通运输', '3'), ('30', '5', '公路旅客运输', '3'), ('31', '6', '道路货物运输', '3'), ('32', '7', '客运汽车站', '3'), ('33', '8', '公路管理与养护', '3'), ('34', '9', '其他道路运输辅助活动', '3'), ('35', '1', '未维修', '4'), ('36', '2', '维修中', '4'), ('37', '3', '维修延期', '4'), ('38', '4', '维修完成', '4'), ('40', '9', '其他', '4'), ('41', '0', '未损坏', '5'), ('42', '1', '轻度损坏', '5'), ('43', '2', '中度损坏', '5'), ('44', '3', '重度损坏', '5'), ('46', '1', '未维护', '6'), ('47', '2', '维护中', '6'), ('48', '3', '维护完成', '6'), ('52', '4', '维护延期', '6'), ('53', '1', '一级维护', '7'), ('54', '2', '二级维护', '7'), ('55', '3', '三级维护', '7'), ('62', '2', '商业险', '8'), ('63', '1', '交强险', '8'), ('65', '2', '否', '9'), ('66', '1', 'A1', '10'), ('67', '2', 'A2', '10'), ('68', '3', 'A3', '10'), ('69', '4', 'B1', '10'), ('70', '5', 'B2', '10'), ('71', '6', 'B3', '10'), ('72', '7', 'C1', '10'), ('73', '8', 'C2', '10'), ('74', '9', 'C3', '10'), ('75', '10', 'C4', '10'), ('76', '1', '桌面客户端', '11'), ('77', '2', 'Web客户端', '11'), ('78', '3', '手机客户端(ios)', '11'), ('79', '4', '手机客户端(Android)', '11'), ('80', '0', 'GPRS', '12'), ('81', '1', 'CDMA', '12'), ('82', '2', 'EVDO', '12'), ('83', '3', 'WCDMA', '12'), ('84', '4', 'EDGE', '12'), ('85', '5', 'TDSCDMA', '12'), ('86', '6', 'LTE-TDD', '12'), ('87', '7', 'LTE-FDD', '12'), ('88', '1', '省内', '15'), ('89', '2', '跨省', '15'), ('90', '3', '进京报备', '15'), ('91', '1', '是', '16'), ('92', '0', '否', '16'), ('93', '1', '驾驶员', '19'), ('94', '2', '送货员', '19'), ('100', '0', '未处理', '17'), ('101', '1', '已处理', '17'), ('102', '2', '保留', '17'), ('103', '3', '将来处理', '17'), ('104', '0', '自动处理', '18'), ('105', '1', '快速拍照', '18'), ('106', '2', '下发短信', '18'), ('107', '3', '对讲', '18'), ('108', '4', '广播', '18'), ('109', '5', '监听', '18'), ('110', '6', '人工确认报警', '18'), ('111', '7', '批处理', '18'), ('112', '30', '处理中', '18'), ('113', '31', '不处理', '18'), ('114', '32', '将来处理', '18'), ('115', '1', '平台', '20'), ('116', '2', '设备', '20'), ('117', '1', '第三方平台', '21'), ('118', '2', '科达平台', '21'), ('119', '3', '其他', '21');
COMMIT;

-- ----------------------------
--  清空 `service_word_book_desc`
-- ----------------------------
truncate table service_word_book_desc;

BEGIN;
INSERT INTO `service_word_book_desc` VALUES ('1', '车辆类型'), ('2', '组织架构类型'), ('3', '组织架构用途类型'), ('4', '维修进度状态类型'), ('5', '损坏程度状态类型'), ('6', '保养进度类型'), ('7', '保养类型'), ('8', '保险类型'), ('9', '状态类型'), ('10', '驾照类型'), ('11', '客户端类型'), ('12', '网络类型'), ('15', '区域类型'), ('16', 'GDS是否包含'), ('17', '处理状态'), ('18', '处理方式'), ('19', '人员类型'), ('20', '报警来源'), ('21', '平台');
COMMIT;

