--    sql更新记录文件



-- ------------------------------------------------------
-- 修改日期：2016-10-24 16:35:50
-- 修改人：  LGQ
-- 修改备注：事例demo
-- ------------------------------------------------------

-- --USE CourtGms;
-- 插入语句 insert into 表名 values (值1,值2,值3,值4,值5,值6);
-- INSERT INTO gms_action_log VALUES (2039,2,28,'192.168.90.32','User',28,'admin在2016-10-18 11:44:27退出系统',1,1476762267,2),(2040,1,1,'192.168.90.32','User',1,'root在2016-10-18 11:44:34登录了后台',1,1476762274,2);
-- 更新语句 update 表名 set 字段 = 值 where 筛选条件;
-- UPDATE gms_user set username = 'root' where id = 1;

-- ------------------------------------------------------
-- 修改日期：2016-10-24 16:35:18
-- 修改人：  LGQ
-- 修改备注：事例demo
-- ------------------------------------------------------
USE CourtGms;
select * from gms_user;